Catalogs/DMS_КодыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_КодыОпераций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Модели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_КодыОпераций/Ext/ManagerModule.bsl
Функция ПолучитьКодОперацииПоМодели(Модель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	DMS_КодыОперацийМодели.Ссылка
	               |ИЗ
	               |	Справочник.DMS_КодыОпераций.Модели КАК DMS_КодыОперацийМодели
	               |ГДЕ
	               |	DMS_КодыОперацийМодели.Модель = &Модель";
				   
	Запрос.УстановитьПараметр("Модель", Модель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Справочники.DMS_КодыОпераций.ПустаяСсылка();		
		
	КонецЕсли;	
	
КонецФункции
